app/views/home/index.html.erb

SELECT "events".* FROM "events" WHERE "events"."user_id" = 3 LIMIT 1
---
<% else %>
	<% @events = Event.find_all_by_user_id(session[:user_id]) %>