app/views/events/show.html.erb

SELECT "up_files".* FROM "up_files" WHERE "up_files"."event_id" = 13
SELECT COUNT(*) FROM "up_files" WHERE "up_files"."event_id" = 12
---
<!-- Table of users go here -->
<% if @event.up_files.empty? %>