app/controllers/events_controller.rb

  def index
	if session[:user_id]
		@events = Event.find_all_by_user_id(session[:user_id])
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = 3

  def create
	if session[:user_id]
		@event = Event.new(params[:event])
		@event.user_id = session[:user_id]

		respond_to do |format|
			if @event.save
				@event.guest_list.split(';').each do |g|
					@up_file = UpFile.new()
					@up_file.mail = g
					@up_file.event_id = @event.id
					if @up_file.save
---
INSERT INTO "events" ("created_at", "end_date", "file_type", "guest_list", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "up_files" ("Url", "created_at", "event_id", "mail", "updated_at", "upload_file_content_type", "upload_file_file_name", "upload_file_file_size", "upload_file_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @event = Event.find(params[:id])

	if session[:user_id] == @event.user_id
		respond_to do |format|
			if @event.update_attributes(params[:event])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "12"]]
UPDATE "events" SET "guest_list" = 'chocro@gmail.com', "updated_at" = '2013-03-27 01:01:39.409805' WHERE "events"."id" = 12

  def destroy
    @event = Event.find(params[:id])
	if @event.user_id == session[:user_id]
		@event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 3]]