app/controllers/home_controller.rb

SELECT "users".* FROM "users" WHERE "users"."mail" = 'timartin@uc.cl' LIMIT 1
SELECT 1 AS one FROM "users" WHERE "users"."mail" = 'timartin@uc.cl' LIMIT 1
---
	def index
		if params[:commit] == "Login"
			if User.exists?(:mail => params[:mail])