app/controllers/up_files_controller.rb

SELECT "up_files".* FROM "up_files"
---
  def index
	if session[:user_id]
		@up_files = UpFile.all

SELECT "up_files".* FROM "up_files" WHERE "up_files"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @up_file = UpFile.find(params[:id])

SELECT "up_files".* FROM "up_files" WHERE "up_files"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @up_file = UpFile.find(params[:id])

INSERT INTO "up_files" ("Url", "created_at", "event_id", "mail", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Url", "gt4w"], ["created_at", Wed, 20 Mar 2013 19:39:33 UTC +00:00], ["event_id", nil], ["mail", "bfdb"], ["updated_at", Wed, 20 Mar 2013 19:39:33 UTC +00:00]]
---
  def create
    @up_file = UpFile.new(params[:up_file])

    respond_to do |format|
      if @up_file.save

SELECT "up_files".* FROM "up_files" WHERE "up_files"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "up_files" SET "Url" = '', "upload_file_file_name" = 'je_ne_suis_pas_banal__by_antiander-d5yq1n3.png', "upload_file_content_type" = 'image/png', "upload_file_file_size" = 3675233, "upload_file_updated_at" = '2013-03-27 01:42:47.765184', "updated_at" = '2013-03-27 01:42:47.766184' WHERE "up_files"."id" = 18
---
  def update
    @up_file = UpFile.find(params[:id])

    respond_to do |format|
      if @up_file.update_attributes(params[:up_file])

SELECT "up_files".* FROM "up_files" WHERE "up_files"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "up_files" WHERE "up_files"."id" = ?  [["id", 1]]
---
  def destroy
    @up_file = UpFile.find(params[:id])
    @up_file.destroy

SELECT "up_files".* FROM "up_files" WHERE "up_files"."mail" = 'timartin@mailop.com' AND "up_files"."event_id" IS NULL LIMIT 1
SELECT 1 AS one FROM "up_files" WHERE "up_files"."mail" = '1' AND "up_files"."event_id" = 1 LIMIT 1
---
	def upload
		if !params[:mail] or !params[:event] or !params[:token]
			flash[:error] = "Invalid link"
			redirect_to home_path
		else
			if !UpFile.exists?(:mail=> params[:mail], :event_id => params[:event])