app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "mail", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 20 Mar 2013 00:21:13 UTC +00:00], ["mail", "timartin@uc.cl"], ["password", "password"], ["updated_at", Wed, 20 Mar 2013 00:21:13 UTC +00:00]]